# CantCopyLevelsOrRefPlanesToNonMassFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CantCopyLevelsOrRefPlanesToNonMassFamily Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't copy levels or reference planes to families that are not Mass families.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCopyLevelsOrRefPlanesToNonMassFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCopyLevelsOrRefPlanesToNonMassFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCopyLevelsOrRefPlanesToNonMassFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace